tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GNU Emacs text editor
brew "emacs", args: ["with-cocoa"], restart_service: true
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Manage compile and link flags for libraries
brew "pkg-config"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", link: false
# Port scanning utility for large networks
brew "nmap"
# Simplified-traditional Chinese conversion tool
brew "opencc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Dumb downloader that scrapes the web
brew "you-get"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
cask "aerial"
cask "anaconda"
cask "appcleaner"
cask "docker"
cask "emacs"
cask "evernote"
cask "font-source-code-pro"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "keyboardcleantool"
cask "qlcolorcode"
cask "quicklook-json"
cask "squirrel"
